In [38]:
import pandas as pd

df = pd.DataFrame([
        ['서울', 18189, 17925],
        ['인천', 10204, 10204],
        ['대구', 8080, 8080]
    ], columns=['지역', '2013년 12월', '2014년 1월'])

print(df)

   지역  2013년 12월  2014년 1월
0  서울      18189     17925
1  인천      10204     10204
2  대구       8080      8080

In [39]:
df = pd.melt(df, id_vars=['지역'], value_vars=['2013년 12월', '2014년 1월']) #2013년 12월, 2014년 1월 열(column)을 값으로 이동

print(df)

   지역   variable  value
0  서울  2013년 12월  18189
1  인천  2013년 12월  10204
2  대구  2013년 12월   8080
3  서울   2014년 1월  17925
4  인천   2014년 1월  10204
5  대구   2014년 1월   8080

In [47]:
df = pd.DataFrame(
{"a" : [4 ,5, 6, 6],
"b" : [7, 8, 9, 9],
"c" : [10, 11, 11, 11]},
index = [1, 2, 3, 4])

df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  11
4  6  9  11

In [48]:
df['a'].value_counts()

6    2
5    1
4    1
Name: a, dtype: int64

In [49]:
len(df)

4

In [50]:
df['a'].nunique()

3

In [51]:
df.describe()

              a         b      c
count  4.000000  4.000000   4.00
mean   5.250000  8.250000  10.75
std    0.957427  0.957427   0.50
min    4.000000  7.000000  10.00
25%    4.750000  7.750000  10.75
50%    5.500000  8.500000  11.00
75%    6.000000  9.000000  11.00
max    6.000000  9.000000  11.00

In [54]:
df.sum()

a    21
b    33
c    43
dtype: int64

In [55]:
df.mean()

a     5.25
b     8.25
c    10.75
dtype: float64

In [56]:
df.quantile([0.25, 0.75])

         a     b      c
0.25  4.75  7.75  10.75
0.75  6.00  9.00  11.00

In [58]:
df.var()

a    0.916667
b    0.916667
c    0.250000
dtype: float64

In [59]:
df.std()

a    0.957427
b    0.957427
c    0.500000
dtype: float64

In [60]:
df.dropna()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  11
4  6  9  11

In [63]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  11
4  6  9  11

In [62]:
df.assign(Area = lambda df: df.a*df.b)

   a  b   c  Area
1  4  7  10    28
2  5  8  11    40
3  6  9  11    54
4  6  9  11    54

In [65]:
df['Volume'] = df.a*df.b*df.c
df

   a  b   c  Volume
1  4  7  10     280
2  5  8  11     440
3  6  9  11     594
4  6  9  11     594